Show / Hide Table of Contents
Class Member2D
Representation of member2D
Inheritance
System.Object
OpenObject
OpenElementId
Member2D
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.Member2D,CI.StructuralElements", "CI.StructModel.Structure.IMember2D,CI.BasicTypes")]
public class Member2D : OpenElementId
Constructors
Improve this Doc   View Source
Member2D()
Constructor
Declaration
public Member2D()
Properties
Improve this Doc   View Source
Elements2D
Array of element2D
Declaration
public List<ReferenceElement> Elements2D { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
List of Element2D
Improve this Doc   View Source
Members1D
Array of internal members, ribs
Declaration
public List<ReferenceElement> Members1D { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
Name
Name of Member
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source